In [1]:
import pandas as pd
import numpy as np

In [3]:
# read in the items csv
items = pd.read_csv('Data/items.csv', encoding='cp1252')
items.head()

,item_name,item_id,item_category_id
0,! POWER IN glamor (PLAST.) D,0,40
1,! ABBYY FineReader 12 Professional Edition Ful...,1,76
2,*** In the glory (UNV) D,2,40
3,*** BLUE WAVE (Univ) D,3,40
4,*** BOX (GLASS) D,4,40

In [14]:
items.dtypes

item_name           object
item_id              int64
item_category_id     int64
dtype: object

In [17]:
items.tail()

,item_name,item_id,item_category_id
22165,"Nuclear titbit 2 [PC, Digital Version]",22165,31
22166,Language 1C queries: Enterprises [Digital Vers...,22166,54
22167,1C query language: Enterprise 8 (+ CD). Khrust...,22167,49
22168,Egg for Little Inu,22168,62
22169,Dragon egg (Game of Thrones),22169,69

In [15]:
# strip out exclmation points, quotes, and asterisks
items['item_name'] = items['item_name'].str.replace('!','')
items['item_name'] = items['item_name'].str.replace('*','')
items['item_name'] = items['item_name'].str.replace('"','')
items['item_name'] = items['item_name'].str.replace("'",'')
items['item_name'] = items['item_name'].str.replace('/','')
items.head()

,item_name,item_id,item_category_id
0,POWER IN glamor (PLAST.) D,0,40
1,ABBYY FineReader 12 Professional Edition Full...,1,76
2,In the glory (UNV) D,2,40
3,BLUE WAVE (Univ) D,3,40
4,BOX (GLASS) D,4,40

In [18]:
items.to_csv('Data/cleaned_items.csv', encoding='utf-8', index=False)

In [19]:
# read in the sales_train csv
sales_train = pd.read_csv('Data/sales_train.csv')
sales_train.head()

         date  date_block_num  shop_id  item_id  item_price  item_cnt_day
0  02.01.2013               0       59    22154      999.00             1
1  03.01.2013               0       25     2552      899.00             1
2  05.01.2013               0       25     2552      899.00            -1
3  06.01.2013               0       25     2554     1709.05             1
4  15.01.2013               0       25     2555     1099.00             1

In [27]:
sales_train.dtypes

date              datetime64[ns]
date_block_num             int64
shop_id                    int64
item_id                    int64
item_price               float64
item_cnt_day               int64
dtype: object

In [24]:
# convert date to a datetime object
sales_train['date'] = pd.to_datetime(sales_train['date'])
sales_train.head()

        date  date_block_num  shop_id  item_id  item_price  item_cnt_day
0 2013-02-01               0       59    22154      999.00             1
1 2013-03-01               0       25     2552      899.00             1
2 2013-05-01               0       25     2552      899.00            -1
3 2013-06-01               0       25     2554     1709.05             1
4 2013-01-15               0       25     2555     1099.00             1

In [28]:
# save to a new csv without an index.
sales_train.to_csv('Data/clean_sales_train.csv', encoding='utf-8', index=False)

In [23]:
shops = pd.read_csv('Data/shops.csv', encoding='cp1252')
shops.head()

                          shop_name  shop_id
0   Yakutsk Ordzhonikidze, 56 Franc        0
1        Yakutsk TC "Central" Franc        1
2                  Adygea TC "Mega"        2
3  Balashikha TRC "October-Kinomir"        3
4             Czechs SEC "Carnival"       56